*** src/bar.rs:12:5: replace bar -> char with Default::default()

*** mutation diff:
--- src/bar.rs
+++ replace bar -> char with Default::default()
@@ -4,19 +4,17 @@
 //! here so they're trivially unit-testable and reusable.
 
 /// 8 spark characters from low to high.
 pub const SPARK_CHARS: [char; 8] = ['▁', '▂', '▃', '▄', '▅', '▆', '▇', '█'];
 
 /// Pick a spark character for a percentage in 0..=100.
 /// Matches the bash mapping: `${BARS:$((v * 8 / 101)):1}`.
 pub fn bar(pct: u8) -> char {
-    let pct = pct.min(100);
-    let idx = (pct as usize * 8) / 101;
-    SPARK_CHARS[idx]
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 // ANSI color escape codes.
 pub const RESET: &str = "\x1b";
 pub const RED_BOLD: &str = "\x1b";
 pub const YELLOW_BOLD: &str = "\x1b";
 pub const GREY: &str = "\x1b";
 pub const DIM: &str = "\x1b";

---- bar::tests::bar_highest_char_for_full stdout ----

thread 'bar::tests::bar_highest_char_for_full' (27704402) panicked at src/bar.rs:50:9:
assertion `left == right` failed
  left: '\0'
 right: '█'

---- bar::tests::bar_progression_covers_eight_levels stdout ----

thread 'bar::tests::bar_progression_covers_eight_levels' (27704404) panicked at src/bar.rs:59:9:
assertion `left == right` failed: expected all 8 spark levels: got {'\0'}
  left: 1
 right: 8

---- bar::tests::bar_lowest_chars_for_low_pct stdout ----

thread 'bar::tests::bar_lowest_chars_for_low_pct' (27704403) panicked at src/bar.rs:43:9:
assertion `left == right` failed
  left: '\0'
 right: '▁'

failures:
    bar::tests::bar_highest_char_for_full
    bar::tests::bar_lowest_chars_for_low_pct
    bar::tests::bar_progression_covers_eight_levels

test result: FAILED. 52 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
