*** src/bar.rs:13:34: replace / with % in bar

*** mutation diff:
--- src/bar.rs
+++ replace / with % in bar
@@ -5,17 +5,17 @@
 
 /// 8 spark characters from low to high.
 pub const SPARK_CHARS: [char; 8] = ['▁', '▂', '▃', '▄', '▅', '▆', '▇', '█'];
 
 /// Pick a spark character for a percentage in 0..=100.
 /// Matches the bash mapping: `${BARS:$((v * 8 / 101)):1}`.
 pub fn bar(pct: u8) -> char {
     let pct = pct.min(100);
-    let idx = (pct as usize * 8) / 101;
+    let idx = (pct as usize * 8) % /* ~ changed by cargo-mutants ~ */ 101;
     SPARK_CHARS[idx]
 }
 
 // ANSI color escape codes.
 pub const RESET: &str = "\x1b";
 pub const RED_BOLD: &str = "\x1b";
 pub const YELLOW_BOLD: &str = "\x1b";
 pub const GREY: &str = "\x1b";

---- bar::tests::bar_highest_char_for_full stdout ----

thread 'bar::tests::bar_highest_char_for_full' (27705223) panicked at src/bar.rs:14:5:
index out of bounds: the len is 8 but the index is 93

---- bar::tests::bar_lowest_chars_for_low_pct stdout ----

thread 'bar::tests::bar_lowest_chars_for_low_pct' (27705224) panicked at src/bar.rs:14:5:
index out of bounds: the len is 8 but the index is 96

---- bar::tests::bar_progression_covers_eight_levels stdout ----

thread 'bar::tests::bar_progression_covers_eight_levels' (27705225) panicked at src/bar.rs:14:5:
index out of bounds: the len is 8 but the index is 8

failures:
    bar::tests::bar_highest_char_for_full
    bar::tests::bar_lowest_chars_for_low_pct
    bar::tests::bar_progression_covers_eight_levels
    tests::render_d7_at_exact_reset_is_not_stale
    tests::render_d7_current_color_default_when_on_pace
    tests::render_d7_current_color_red_when_delta_above_30
    tests::render_d7_current_color_red_when_pct_at_or_above_90
    tests::render_d7_current_color_yellow_when_delta_in_11_to_30
    tests::render_d7_only_current_bucket_uses_current_color
    tests::render_h5_at_exact_reset_is_not_stale
    tests::render_h5_no_resets_at_renders_past_color
    tests::render_h5_red_at_pct_90

test result: FAILED. 41 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
