*** src/bar.rs:34:14: replace > with == in pace_color

*** mutation diff:
--- src/bar.rs
+++ replace > with == in pace_color
@@ -26,17 +26,17 @@
 pub fn ctx_color(pct: u8) -> &'static str {
     if pct >= 80 { RED_BOLD }
     else if pct >= 50 { YELLOW_BOLD }
     else { GREY }
 }
 
 /// Color tier for pace warnings (delta = utilization - elapsed%).
 pub fn pace_color(delta: i32) -> &'static str {
-    if delta > 30 { RED_BOLD }
+    if delta == /* ~ changed by cargo-mutants ~ */ 30 { RED_BOLD }
     else if delta > 10 { YELLOW_BOLD }
     else { GREY }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;

---- bar::tests::pace_color_yellow_above_10_through_30 stdout ----

thread 'bar::tests::pace_color_yellow_above_10_through_30' (27713746) panicked at src/bar.rs:92:9:
assertion `left == right` failed
  left: "\u{1b}"
 right: "\u{1b}"

---- bar::tests::pace_color_red_above_30 stdout ----

thread 'bar::tests::pace_color_red_above_30' (27713745) panicked at src/bar.rs:97:9:
assertion `left == right` failed
  left: "\u{1b}"
 right: "\u{1b}"

failures:
    bar::tests::pace_color_red_above_30
    bar::tests::pace_color_yellow_above_10_through_30

test result: FAILED. 53 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
