*** src/bar.rs:34:5: replace pace_color -> &'static str with "xyzzy"

*** mutation diff:
--- src/bar.rs
+++ replace pace_color -> &'static str with "xyzzy"
@@ -26,19 +26,17 @@
 pub fn ctx_color(pct: u8) -> &'static str {
     if pct >= 80 { RED_BOLD }
     else if pct >= 50 { YELLOW_BOLD }
     else { GREY }
 }
 
 /// Color tier for pace warnings (delta = utilization - elapsed%).
 pub fn pace_color(delta: i32) -> &'static str {
-    if delta > 30 { RED_BOLD }
-    else if delta > 10 { YELLOW_BOLD }
-    else { GREY }
+    "xyzzy" /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn bar_lowest_chars_for_low_pct() {

---- bar::tests::pace_color_red_above_30 stdout ----

thread 'bar::tests::pace_color_red_above_30' (27713418) panicked at src/bar.rs:95:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "\u{1b}"

---- bar::tests::pace_color_grey_at_low_delta stdout ----

thread 'bar::tests::pace_color_grey_at_low_delta' (27713417) panicked at src/bar.rs:82:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "\u{1b}"

---- bar::tests::pace_color_yellow_above_10_through_30 stdout ----

thread 'bar::tests::pace_color_yellow_above_10_through_30' (27713419) panicked at src/bar.rs:89:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "\u{1b}"

failures:
    bar::tests::pace_color_grey_at_low_delta
    bar::tests::pace_color_red_above_30
    bar::tests::pace_color_yellow_above_10_through_30
    tests::render_h5_below_90_uses_pace_color_not_red
    tests::render_h5_yellow_when_pace_delta_above_10

test result: FAILED. 50 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
