*** src/cycle.rs:20:33: replace * with +

*** mutation diff:
--- src/cycle.rs
+++ replace * with +
@@ -12,17 +12,17 @@
 
 /// Cycles are considered "the same" if their reset timestamps are within
 /// this many seconds. The Anthropic API drifts the reset timestamp by a
 /// second or two between calls; without this slack we'd treat every drift
 /// as a brand-new cycle.
 pub const CYCLE_MATCH_TOLERANCE_S: i64 = 60;
 
 /// Standard 7-day cycle length in seconds.
-pub const SEVEN_DAYS_S: i64 = 7 * 86_400;
+pub const SEVEN_DAYS_S: i64 = 7 + /* ~ changed by cargo-mutants ~ */ 86_400;
 
 /// Find the start of the cycle that contains `reset_ts`.
 ///
 /// Strategy: use the most recent prior cycle's reset as our cycle_start,
 /// provided it's "clearly older" (more than CYCLE_MATCH_TOLERANCE_S
 /// seconds before `reset_ts`) and within 7 days. Otherwise treat this
 /// cycle as a cold start spanning `reset_ts - 7d` to `reset_ts`.
 ///

---- cycle::tests::bucket_idx_partitions_seven_days_correctly stdout ----

thread 'cycle::tests::bucket_idx_partitions_seven_days_correctly' (27720059) panicked at src/cycle.rs:243:9:
assertion `left == right` failed
  left: 6
 right: 4

---- cycle::tests::cycle_start_excludes_stored_reset_at_exactly_60s_drift stdout ----

thread 'cycle::tests::cycle_start_excludes_stored_reset_at_exactly_60s_drift' (27720061) panicked at src/cycle.rs:169:9:
assertion `left == right` failed: 60s drift should still exclude same-cycle reset
  left: 1777964453
 right: 1777446000

---- cycle::tests::cycle_start_excludes_stored_reset_within_drift_tolerance stdout ----

thread 'cycle::tests::cycle_start_excludes_stored_reset_within_drift_tolerance' (27720062) panicked at src/cycle.rs:157:9:
assertion `left == right` failed
  left: 1777964394
 right: 1777446000

failures:
    cycle::tests::bucket_idx_partitions_seven_days_correctly
    cycle::tests::cycle_start_excludes_stored_reset_at_exactly_60s_drift
    cycle::tests::cycle_start_excludes_stored_reset_within_drift_tolerance
    cycle::tests::cycle_start_uses_prev_reset_when_within_7d
    tests::render_d7_current_color_default_when_on_pace
    tests::render_d7_current_color_yellow_when_delta_in_11_to_30

test result: FAILED. 49 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
