*** src/cycle.rs:40:24: replace + with - in cycle_start_for_reset

*** mutation diff:
--- src/cycle.rs
+++ replace + with - in cycle_start_for_reset
@@ -32,17 +32,17 @@
 /// pinned bucket index to 0, and combined with the daily-max guard
 /// caused the leftmost bar to grow on every render. See the
 /// `drift_does_not_collapse_idx_to_zero` outer test.
 pub fn cycle_start_for_reset(reset_ts: i64, history: &History) -> i64 {
     let prev = history
         .cycles
         .iter()
         .map(|c| c.reset)
-        .filter(|&r| r + CYCLE_MATCH_TOLERANCE_S < reset_ts)
+        .filter(|&r| r - /* ~ changed by cargo-mutants ~ */ CYCLE_MATCH_TOLERANCE_S < reset_ts)
         .max();
 
     match prev {
         Some(p) if reset_ts - p <= SEVEN_DAYS_S + CYCLE_MATCH_TOLERANCE_S => p,
         _ => reset_ts - SEVEN_DAYS_S,
     }
 }

---- cycle::tests::cycle_start_excludes_stored_reset_within_drift_tolerance stdout ----

thread 'cycle::tests::cycle_start_excludes_stored_reset_within_drift_tolerance' (27727118) panicked at src/cycle.rs:157:9:
assertion `left == right` failed
  left: 1778050800
 right: 1777446000

---- cycle::tests::cycle_start_excludes_stored_reset_at_exactly_60s_drift stdout ----

thread 'cycle::tests::cycle_start_excludes_stored_reset_at_exactly_60s_drift' (27727117) panicked at src/cycle.rs:169:9:
assertion `left == right` failed: 60s drift should still exclude same-cycle reset
  left: 1778050800
 right: 1777446000

---- tests::render_d7_current_color_default_when_on_pace stdout ----

thread 'tests::render_d7_current_color_default_when_on_pace' (27727142) panicked at src/lib.rs:304:9:
on-pace should not be RED: "\u{1b}▄\u{1b}▃\u{1b}▄\u{1b}▅\u{1b}▆\u{1b}▇\u{1b}█"

failures:
    cycle::tests::cycle_start_excludes_stored_reset_at_exactly_60s_drift
    cycle::tests::cycle_start_excludes_stored_reset_within_drift_tolerance
    tests::render_d7_current_color_default_when_on_pace
    tests::render_d7_current_color_yellow_when_delta_in_11_to_30

test result: FAILED. 51 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
