*** src/cycle.rs:52:5: replace bucket_idx -> usize with 0

*** mutation diff:
--- src/cycle.rs
+++ replace bucket_idx -> usize with 0
@@ -44,19 +44,17 @@
         Some(p) if reset_ts - p <= SEVEN_DAYS_S + CYCLE_MATCH_TOLERANCE_S => p,
         _ => reset_ts - SEVEN_DAYS_S,
     }
 }
 
 /// Compute the bucket index for `now` within a cycle running from
 /// `cycle_start` to `cycle_start + cycle_len`. Returns 0..=6.
 pub fn bucket_idx(now: i64, cycle_start: i64, cycle_len: i64) -> usize {
-    let bucket_size = (cycle_len / 7).max(60);
-    let elapsed = (now - cycle_start).max(0);
-    ((elapsed / bucket_size) as usize).min(6)
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Locate the cycle in history matching `reset_ts` within tolerance.
 /// Returns the cycle's index in `history.cycles` if found.
 pub fn match_cycle(reset_ts: i64, history: &History) -> Option<usize> {
     history
         .cycles
         .iter()

---- cycle::tests::bucket_idx_floors_minimum_bucket_size stdout ----

thread 'cycle::tests::bucket_idx_floors_minimum_bucket_size' (27736756) panicked at src/cycle.rs:249:9:
assertion `left == right` failed
  left: 0
 right: 2

---- cycle::tests::bucket_idx_partitions_seven_days_correctly stdout ----

thread 'cycle::tests::bucket_idx_partitions_seven_days_correctly' (27736757) panicked at src/cycle.rs:241:9:
assertion `left == right` failed
  left: 0
 right: 4

---- cycle::tests::bucket_idx_clamps_to_six_at_cycle_end stdout ----

thread 'cycle::tests::bucket_idx_clamps_to_six_at_cycle_end' (27736754) panicked at src/cycle.rs:227:9:
assertion `left == right` failed
  left: 0
 right: 6

failures:
    cycle::tests::bucket_idx_clamps_to_six_at_cycle_end
    cycle::tests::bucket_idx_floors_minimum_bucket_size
    cycle::tests::bucket_idx_partitions_seven_days_correctly

test result: FAILED. 52 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
