*** src/cycle.rs:53:24: replace - with + in bucket_idx

*** mutation diff:
--- src/cycle.rs
+++ replace - with + in bucket_idx
@@ -45,17 +45,17 @@
         _ => reset_ts - SEVEN_DAYS_S,
     }
 }
 
 /// Compute the bucket index for `now` within a cycle running from
 /// `cycle_start` to `cycle_start + cycle_len`. Returns 0..=6.
 pub fn bucket_idx(now: i64, cycle_start: i64, cycle_len: i64) -> usize {
     let bucket_size = (cycle_len / 7).max(60);
-    let elapsed = (now - cycle_start).max(0);
+    let elapsed = (now + /* ~ changed by cargo-mutants ~ */ cycle_start).max(0);
     ((elapsed / bucket_size) as usize).min(6)
 }
 
 /// Locate the cycle in history matching `reset_ts` within tolerance.
 /// Returns the cycle's index in `history.cycles` if found.
 pub fn match_cycle(reset_ts: i64, history: &History) -> Option<usize> {
     history
         .cycles

---- tests::render_d7_only_current_bucket_uses_current_color stdout ----

thread 'tests::render_d7_only_current_bucket_uses_current_color' (27740371) panicked at src/lib.rs:241:9:
assertion `left == right` failed: expected exactly 3 PAST-colored cells: "\u{1b}▁\u{1b}▂\u{1b}▃\u{1b}▄\u{1b}▄\u{1b}▄\u{1b}▄"
  left: 6
 right: 3

failures:
    tests::render_d7_only_current_bucket_uses_current_color

test result: FAILED. 54 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
