*** src/cycle.rs:60:5: replace match_cycle -> Option<usize> with None

*** mutation diff:
--- src/cycle.rs
+++ replace match_cycle -> Option<usize> with None
@@ -52,20 +52,17 @@
     let bucket_size = (cycle_len / 7).max(60);
     let elapsed = (now - cycle_start).max(0);
     ((elapsed / bucket_size) as usize).min(6)
 }
 
 /// Locate the cycle in history matching `reset_ts` within tolerance.
 /// Returns the cycle's index in `history.cycles` if found.
 pub fn match_cycle(reset_ts: i64, history: &History) -> Option<usize> {
-    history
-        .cycles
-        .iter()
-        .position(|c| (c.reset - reset_ts).abs() <= CYCLE_MATCH_TOLERANCE_S)
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Update the bucket at `idx` with `pct` using the daily-peak rule:
 /// keep `max(stored, pct)`. Returns the new value stored.
 ///
 /// This is the per-day peak invariant. Multiple renders during a single
 /// day can vary in the reported `pct` (rolling-window noise, mid-day
 /// dips); we keep only the highest. See the

---- cycle::tests::match_cycle_finds_within_60s_either_direction stdout ----

thread 'cycle::tests::match_cycle_finds_within_60s_either_direction' (27743848) panicked at src/cycle.rs:259:9:
assertion `left == right` failed
  left: None
 right: Some(1)

---- tests::render_d7_only_current_bucket_uses_current_color stdout ----

thread 'tests::render_d7_only_current_bucket_uses_current_color' (27743867) panicked at src/lib.rs:241:9:
assertion `left == right` failed: expected exactly 3 PAST-colored cells: "\u{1b}▂\u{1b}▃\u{1b}▄\u{1b}▄\u{1b}▆\u{1b}▇\u{1b}█"
  left: 0
 right: 3

failures:
    cycle::tests::match_cycle_finds_within_60s_either_direction
    tests::render_d7_only_current_bucket_uses_current_color

test result: FAILED. 53 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
