*** src/cycle.rs:60:5: replace match_cycle -> Option<usize> with Some(0)

*** mutation diff:
--- src/cycle.rs
+++ replace match_cycle -> Option<usize> with Some(0)
@@ -52,20 +52,17 @@
     let bucket_size = (cycle_len / 7).max(60);
     let elapsed = (now - cycle_start).max(0);
     ((elapsed / bucket_size) as usize).min(6)
 }
 
 /// Locate the cycle in history matching `reset_ts` within tolerance.
 /// Returns the cycle's index in `history.cycles` if found.
 pub fn match_cycle(reset_ts: i64, history: &History) -> Option<usize> {
-    history
-        .cycles
-        .iter()
-        .position(|c| (c.reset - reset_ts).abs() <= CYCLE_MATCH_TOLERANCE_S)
+    Some(0) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Update the bucket at `idx` with `pct` using the daily-peak rule:
 /// keep `max(stored, pct)`. Returns the new value stored.
 ///
 /// This is the per-day peak invariant. Multiple renders during a single
 /// day can vary in the reported `pct` (rolling-window noise, mid-day
 /// dips); we keep only the highest. See the

---- cycle::tests::match_cycle_finds_within_60s_either_direction stdout ----

thread 'cycle::tests::match_cycle_finds_within_60s_either_direction' (27744703) panicked at src/cycle.rs:259:9:
assertion `left == right` failed
  left: Some(0)
 right: Some(1)

---- cycle::tests::match_cycle_misses_just_outside_tolerance stdout ----

thread 'cycle::tests::match_cycle_misses_just_outside_tolerance' (27744704) panicked at src/cycle.rs:267:9:
assertion `left == right` failed
  left: Some(0)
 right: None

---- cycle::tests::match_cycle_returns_none_for_empty_history stdout ----

thread 'cycle::tests::match_cycle_returns_none_for_empty_history' (27744705) panicked at src/cycle.rs:273:9:
assertion `left == right` failed
  left: Some(0)
 right: None

failures:
    cycle::tests::match_cycle_finds_within_60s_either_direction
    cycle::tests::match_cycle_misses_just_outside_tolerance
    cycle::tests::match_cycle_returns_none_for_empty_history
    tests::render_d7_at_exact_reset_is_not_stale

test result: FAILED. 51 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
