*** src/cycle.rs:60:5: replace match_cycle -> Option<usize> with Some(1)

*** mutation diff:
--- src/cycle.rs
+++ replace match_cycle -> Option<usize> with Some(1)
@@ -52,20 +52,17 @@
     let bucket_size = (cycle_len / 7).max(60);
     let elapsed = (now - cycle_start).max(0);
     ((elapsed / bucket_size) as usize).min(6)
 }
 
 /// Locate the cycle in history matching `reset_ts` within tolerance.
 /// Returns the cycle's index in `history.cycles` if found.
 pub fn match_cycle(reset_ts: i64, history: &History) -> Option<usize> {
-    history
-        .cycles
-        .iter()
-        .position(|c| (c.reset - reset_ts).abs() <= CYCLE_MATCH_TOLERANCE_S)
+    Some(1) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Update the bucket at `idx` with `pct` using the daily-peak rule:
 /// keep `max(stored, pct)`. Returns the new value stored.
 ///
 /// This is the per-day peak invariant. Multiple renders during a single
 /// day can vary in the reported `pct` (rolling-window noise, mid-day
 /// dips); we keep only the highest. See the

---- cycle::tests::match_cycle_misses_just_outside_tolerance stdout ----

thread 'cycle::tests::match_cycle_misses_just_outside_tolerance' (27745675) panicked at src/cycle.rs:267:9:
assertion `left == right` failed
  left: Some(1)
 right: None

---- cycle::tests::match_cycle_returns_none_for_empty_history stdout ----

thread 'cycle::tests::match_cycle_returns_none_for_empty_history' (27745676) panicked at src/cycle.rs:273:9:
assertion `left == right` failed
  left: Some(1)
 right: None

---- tests::render_d7_at_exact_reset_is_not_stale stdout ----

thread 'tests::render_d7_at_exact_reset_is_not_stale' (27745686) panicked at src/lib.rs:81:55:
index out of bounds: the len is 0 but the index is 1

failures:
    cycle::tests::match_cycle_misses_just_outside_tolerance
    cycle::tests::match_cycle_returns_none_for_empty_history
    tests::render_d7_at_exact_reset_is_not_stale
    tests::render_d7_current_color_default_when_on_pace
    tests::render_d7_current_color_red_when_delta_above_30
    tests::render_d7_current_color_red_when_pct_at_or_above_90
    tests::render_d7_current_color_yellow_when_delta_in_11_to_30
    tests::render_d7_only_current_bucket_uses_current_color

test result: FAILED. 47 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
