*** src/lib.rs:111:24: replace match guard i == idx with true in render_d7

*** mutation diff:
--- src/lib.rs
+++ replace match guard i == idx with true in render_d7
@@ -103,17 +103,17 @@
     let mut out = String::new();
     for (i, cell) in display.iter().enumerate() {
         match cell {
             None => {
                 let expected = ((i + 1) * 100 / 7) as u8;
                 out.push_str(bar::DIM);
                 out.push(bar::bar(expected));
             }
-            Some(v) if i == idx => {
+            Some(v) if true /* ~ changed by cargo-mutants ~ */ => {
                 out.push_str(current_color);
                 out.push(bar::bar(*v));
             }
             Some(v) => {
                 out.push_str(bar::PAST);
                 out.push(bar::bar(*v));
             }
         }

---- tests::render_d7_only_current_bucket_uses_current_color stdout ----

thread 'tests::render_d7_only_current_bucket_uses_current_color' (27667306) panicked at src/lib.rs:241:9:
assertion `left == right` failed: expected exactly 3 PAST-colored cells: "\u{1b}▁\u{1b}▂\u{1b}▃\u{1b}▄\u{1b}▆\u{1b}▇\u{1b}█"
  left: 0
 right: 3

failures:
    tests::render_d7_only_current_bucket_uses_current_color

test result: FAILED. 54 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
