*** src/lib.rs:126:5: replace render_h5 -> String with String::new()

*** mutation diff:
--- src/lib.rs
+++ replace render_h5 -> String with String::new()
@@ -118,35 +118,17 @@
             }
         }
     }
     out
 }
 
 /// Render the H5 five-hour bar with pace coloring.
 fn render_h5(window: &Window, now_ts: i64) -> String {
-    let pct = window.utilization as u8;
-    let reset_ts = match window.resets_at {
-        Some(dt) => dt.timestamp(),
-        None => return format!("{}{}", bar::PAST, bar::bar(pct)),
-    };
-    if now_ts > reset_ts {
-        if pct == 0 {
-            return format!("{}{}", bar::GREY, bar::bar(0));
-        }
-        return format!("{}{}", bar::RED_BOLD, bar::bar(100));
-    }
-    if pct >= 90 {
-        return format!("{}{}", bar::RED_BOLD, bar::bar(pct));
-    }
-    let elapsed = now_ts - (reset_ts - 18_000);
-    let elapsed_pct = (elapsed * 100 / 18_000) as i32;
-    let delta = (pct as i32) - elapsed_pct;
-    let delta_clamped = delta.clamp(0, 100);
-    format!("{}{}", bar::pace_color(delta_clamped), bar::bar(pct))
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Strip "claude-" prefix and version suffix from a full model ID.
 /// Matches bash: `sed 's/claude-//;s/-[0-9].*//;s/-latest//'`.
 pub fn short_model(id: &str) -> String {
     let s = id.strip_prefix("claude-").unwrap_or(id);
     // Truncate at the first "-<digit>" we find — that begins the version tail.
     let bytes = s.as_bytes();

---- tests::render_h5_below_90_uses_pace_color_not_red stdout ----

thread 'tests::render_h5_below_90_uses_pace_color_not_red' (27677970) panicked at src/lib.rs:334:9:
expected GREY pace color: ""

---- tests::render_h5_no_resets_at_renders_past_color stdout ----

thread 'tests::render_h5_no_resets_at_renders_past_color' (27677971) panicked at src/lib.rs:352:9:
assertion `left == right` failed
  left: ""
 right: "\u{1b}▂"

---- tests::render_h5_stale_with_pct_renders_red_full_bar stdout ----

thread 'tests::render_h5_stale_with_pct_renders_red_full_bar' (27677974) panicked at src/lib.rs:305:9:
assertion `left == right` failed
  left: ""
 right: "\u{1b}█"

failures:
    tests::render_h5_below_90_uses_pace_color_not_red
    tests::render_h5_no_resets_at_renders_past_color
    tests::render_h5_red_at_pct_90
    tests::render_h5_stale_idle_renders_grey_lowest_bar
    tests::render_h5_stale_with_pct_renders_red_full_bar
    tests::render_h5_yellow_when_pace_delta_above_10

test result: FAILED. 49 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
