*** src/lib.rs:131:15: replace > with >= in render_h5

*** mutation diff:
--- src/lib.rs
+++ replace > with >= in render_h5
@@ -123,17 +123,17 @@
 
 /// Render the H5 five-hour bar with pace coloring.
 fn render_h5(window: &Window, now_ts: i64) -> String {
     let pct = window.utilization as u8;
     let reset_ts = match window.resets_at {
         Some(dt) => dt.timestamp(),
         None => return format!("{}{}", bar::PAST, bar::bar(pct)),
     };
-    if now_ts > reset_ts {
+    if now_ts >= /* ~ changed by cargo-mutants ~ */ reset_ts {
         if pct == 0 {
             return format!("{}{}", bar::GREY, bar::bar(0));
         }
         return format!("{}{}", bar::RED_BOLD, bar::bar(100));
     }
     if pct >= 90 {
         return format!("{}{}", bar::RED_BOLD, bar::bar(pct));
     }

---- tests::render_h5_at_exact_reset_is_not_stale stdout ----

thread 'tests::render_h5_at_exact_reset_is_not_stale' (27681892) panicked at src/lib.rs:331:9:
now == reset should not be stale (no full bar): "\u{1b}█"

failures:
    tests::render_h5_at_exact_reset_is_not_stale

test result: FAILED. 54 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
