*** src/lib.rs:132:16: replace == with != in render_h5

*** mutation diff:
--- src/lib.rs
+++ replace == with != in render_h5
@@ -124,17 +124,17 @@
 /// Render the H5 five-hour bar with pace coloring.
 fn render_h5(window: &Window, now_ts: i64) -> String {
     let pct = window.utilization as u8;
     let reset_ts = match window.resets_at {
         Some(dt) => dt.timestamp(),
         None => return format!("{}{}", bar::PAST, bar::bar(pct)),
     };
     if now_ts > reset_ts {
-        if pct == 0 {
+        if pct != /* ~ changed by cargo-mutants ~ */ 0 {
             return format!("{}{}", bar::GREY, bar::bar(0));
         }
         return format!("{}{}", bar::RED_BOLD, bar::bar(100));
     }
     if pct >= 90 {
         return format!("{}{}", bar::RED_BOLD, bar::bar(pct));
     }
     let elapsed = now_ts - (reset_ts - 18_000);

---- tests::render_h5_stale_idle_renders_grey_lowest_bar stdout ----

thread 'tests::render_h5_stale_idle_renders_grey_lowest_bar' (27682814) panicked at src/lib.rs:315:9:
assertion `left == right` failed
  left: "\u{1b}█"
 right: "\u{1b}▁"

---- tests::render_h5_stale_with_pct_renders_red_full_bar stdout ----

thread 'tests::render_h5_stale_with_pct_renders_red_full_bar' (27682815) panicked at src/lib.rs:323:9:
assertion `left == right` failed
  left: "\u{1b}▁"
 right: "\u{1b}█"

failures:
    tests::render_h5_stale_idle_renders_grey_lowest_bar
    tests::render_h5_stale_with_pct_renders_red_full_bar

test result: FAILED. 53 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
