*** src/lib.rs:137:12: replace >= with < in render_h5

*** mutation diff:
--- src/lib.rs
+++ replace >= with < in render_h5
@@ -129,17 +129,17 @@
         None => return format!("{}{}", bar::PAST, bar::bar(pct)),
     };
     if now_ts > reset_ts {
         if pct == 0 {
             return format!("{}{}", bar::GREY, bar::bar(0));
         }
         return format!("{}{}", bar::RED_BOLD, bar::bar(100));
     }
-    if pct >= 90 {
+    if pct < /* ~ changed by cargo-mutants ~ */ 90 {
         return format!("{}{}", bar::RED_BOLD, bar::bar(pct));
     }
     let elapsed = now_ts - (reset_ts - 18_000);
     let elapsed_pct = (elapsed * 100 / 18_000) as i32;
     let delta = (pct as i32) - elapsed_pct;
     let delta_clamped = delta.clamp(0, 100);
     format!("{}{}", bar::pace_color(delta_clamped), bar::bar(pct))
 }

---- tests::render_h5_yellow_when_pace_delta_above_10 stdout ----

thread 'tests::render_h5_yellow_when_pace_delta_above_10' (27683699) panicked at src/lib.rs:362:9:
delta in (10, 30] should be YELLOW: "\u{1b}▃"

---- tests::render_h5_red_at_pct_90 stdout ----

thread 'tests::render_h5_red_at_pct_90' (27683696) panicked at src/lib.rs:340:9:
pct=90 must be RED: "\u{1b}█"

---- tests::render_h5_below_90_uses_pace_color_not_red stdout ----

thread 'tests::render_h5_below_90_uses_pace_color_not_red' (27683694) panicked at src/lib.rs:350:9:
pct=89 with on-pace delta should NOT be RED: "\u{1b}█"

failures:
    tests::render_h5_below_90_uses_pace_color_not_red
    tests::render_h5_red_at_pct_90
    tests::render_h5_yellow_when_pace_delta_above_10

test result: FAILED. 52 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
