*** src/lib.rs:150:5: replace short_model -> String with String::new()

*** mutation diff:
--- src/lib.rs
+++ replace short_model -> String with String::new()
@@ -142,25 +142,17 @@
     let delta = (pct as i32) - elapsed_pct;
     let delta_clamped = delta.clamp(0, 100);
     format!("{}{}", bar::pace_color(delta_clamped), bar::bar(pct))
 }
 
 /// Strip "claude-" prefix and version suffix from a full model ID.
 /// Matches bash: `sed 's/claude-//;s/-[0-9].*//;s/-latest//'`.
 pub fn short_model(id: &str) -> String {
-    let s = id.strip_prefix("claude-").unwrap_or(id);
-    // Truncate at the first "-<digit>" we find — that begins the version tail.
-    let bytes = s.as_bytes();
-    for i in 0..bytes.len().saturating_sub(1) {
-        if bytes[i] == b'-' && bytes[i + 1].is_ascii_digit() {
-            return s[..i].trim_end_matches("-latest").to_string();
-        }
-    }
-    s.trim_end_matches("-latest").to_string()
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use chrono::TimeZone;
 
     #[test]

---- tests::short_model_strips_claude_prefix_and_version stdout ----

thread 'tests::short_model_strips_claude_prefix_and_version' (27693687) panicked at src/lib.rs:160:9:
assertion `left == right` failed
  left: ""
 right: "opus"

failures:
    tests::short_model_strips_claude_prefix_and_version

test result: FAILED. 54 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
