*** src/lib.rs:37:5: replace render -> String with String::new()

*** mutation diff:
--- src/lib.rs
+++ replace render -> String with String::new()
@@ -29,34 +29,17 @@
 /// `now` is injected for deterministic testing. The binary's `main` calls
 /// this with `Utc::now()`.
 pub fn render(
     input: &StatuslineInput,
     now: DateTime<Utc>,
     cache: &ApiCache,
     history: &mut History,
 ) -> String {
-    let now_ts = now.timestamp();
-
-    let d7_out = render_d7(&cache.seven_day, history, now_ts);
-    let h5_out = render_h5(&cache.five_hour, now_ts);
-
-    let ctx_pct = input.context_pct.min(100) as u8;
-    let model_short = short_model(&input.model_id);
-    let ctx_out = format!("{}{} {}", bar::ctx_color(ctx_pct), model_short, bar::bar(ctx_pct));
-
-    format!(
-        "{}{}{}{} {}{}",
-        ctx_out,
-        bar::RESET,
-        h5_out,
-        bar::RESET,
-        d7_out,
-        bar::RESET
-    )
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Render the D7 sparkline and update history with the current observation.
 fn render_d7(window: &Window, history: &mut History, now_ts: i64) -> String {
     let reset_ts = match window.resets_at {
         Some(dt) => dt.timestamp(),
         None => return format!("{}{}", bar::PAST, bar::bar(window.utilization as u8)),
     };

---- cycle_rollover_appends_new_entry stdout ----

thread 'cycle_rollover_appends_new_entry' (27642736) panicked at tests/outer.rs:128:5:
assertion `left == right` failed: rollover should append second cycle
  left: 1
 right: 2

---- drift_does_not_collapse_idx_to_zero stdout ----

thread 'drift_does_not_collapse_idx_to_zero' (27642737) panicked at tests/outer.rs:70:5:
assertion `left == right` failed: current pct should land in bucket[4], got None
  left: None
 right: Some(51)

---- layout_groups_left_meters_and_separates_d7 stdout ----

thread 'layout_groups_left_meters_and_separates_d7' (27642738) panicked at tests/outer.rs:173:5:
assertion `left == right` failed: expected 3 space-separated groups, got [""]
  left: 1
 right: 3

failures:
    cycle_rollover_appends_new_entry
    drift_does_not_collapse_idx_to_zero
    layout_groups_left_meters_and_separates_d7
    max_guard_keeps_daily_peak_across_intraday_renders
    render_produces_nonempty_output_with_model_name

test result: FAILED. 0 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
