*** src/lib.rs:65:15: replace > with == in render_d7

*** mutation diff:
--- src/lib.rs
+++ replace > with == in render_d7
@@ -57,17 +57,17 @@
 /// Render the D7 sparkline and update history with the current observation.
 fn render_d7(window: &Window, history: &mut History, now_ts: i64) -> String {
     let reset_ts = match window.resets_at {
         Some(dt) => dt.timestamp(),
         None => return format!("{}{}", bar::PAST, bar::bar(window.utilization as u8)),
     };
 
     // Stale: reset is in the past (window has rolled over but cache wasn't refreshed).
-    if now_ts > reset_ts {
+    if now_ts == /* ~ changed by cargo-mutants ~ */ reset_ts {
         let pct = window.utilization as u8;
         if pct == 0 {
             return format!("{}·······", bar::GREY);
         }
         return format!("{}███████", bar::RED_BOLD);
     }
 
     let cycle_start = cycle::cycle_start_for_reset(reset_ts, history);

---- tests::render_d7_stale_with_pct_renders_red_full stdout ----

thread 'tests::render_d7_stale_with_pct_renders_red_full' (27645600) panicked at src/lib.rs:204:9:
expected full blocks for stale+nonzero: "\u{1b}▂\u{1b}▃\u{1b}▄\u{1b}▅\u{1b}▆\u{1b}▇\u{1b}▄"

---- tests::render_d7_stale_idle_renders_dim_dots stdout ----

thread 'tests::render_d7_stale_idle_renders_dim_dots' (27645599) panicked at src/lib.rs:193:9:
expected dim dots for stale+idle: "\u{1b}▂\u{1b}▃\u{1b}▄\u{1b}▅\u{1b}▆\u{1b}▇\u{1b}▁"

failures:
    tests::render_d7_stale_idle_renders_dim_dots
    tests::render_d7_stale_with_pct_renders_red_full

test result: FAILED. 53 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
