*** src/lib.rs:65:15: replace > with < in render_d7

*** mutation diff:
--- src/lib.rs
+++ replace > with < in render_d7
@@ -57,17 +57,17 @@
 /// Render the D7 sparkline and update history with the current observation.
 fn render_d7(window: &Window, history: &mut History, now_ts: i64) -> String {
     let reset_ts = match window.resets_at {
         Some(dt) => dt.timestamp(),
         None => return format!("{}{}", bar::PAST, bar::bar(window.utilization as u8)),
     };
 
     // Stale: reset is in the past (window has rolled over but cache wasn't refreshed).
-    if now_ts > reset_ts {
+    if now_ts < /* ~ changed by cargo-mutants ~ */ reset_ts {
         let pct = window.utilization as u8;
         if pct == 0 {
             return format!("{}·······", bar::GREY);
         }
         return format!("{}███████", bar::RED_BOLD);
     }
 
     let cycle_start = cycle::cycle_start_for_reset(reset_ts, history);

---- tests::render_d7_current_color_yellow_when_delta_in_11_to_30 stdout ----

thread 'tests::render_d7_current_color_yellow_when_delta_in_11_to_30' (27648547) panicked at src/lib.rs:289:9:
delta in (10, 30] should be YELLOW: "\u{1b}███████"

---- tests::render_d7_only_current_bucket_uses_current_color stdout ----

thread 'tests::render_d7_only_current_bucket_uses_current_color' (27648548) panicked at src/lib.rs:241:9:
assertion `left == right` failed: expected exactly 3 PAST-colored cells: "\u{1b}███████"
  left: 0
 right: 3

---- tests::render_d7_current_color_default_when_on_pace stdout ----

thread 'tests::render_d7_current_color_default_when_on_pace' (27648544) panicked at src/lib.rs:304:9:
on-pace should not be RED: "\u{1b}███████"

failures:
    tests::render_d7_current_color_default_when_on_pace
    tests::render_d7_current_color_yellow_when_delta_in_11_to_30
    tests::render_d7_only_current_bucket_uses_current_color
    tests::render_d7_stale_idle_renders_dim_dots
    tests::render_d7_stale_with_pct_renders_red_full

test result: FAILED. 50 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
