*** src/lib.rs:67:16: replace == with != in render_d7

*** mutation diff:
--- src/lib.rs
+++ replace == with != in render_d7
@@ -59,17 +59,17 @@
     let reset_ts = match window.resets_at {
         Some(dt) => dt.timestamp(),
         None => return format!("{}{}", bar::PAST, bar::bar(window.utilization as u8)),
     };
 
     // Stale: reset is in the past (window has rolled over but cache wasn't refreshed).
     if now_ts > reset_ts {
         let pct = window.utilization as u8;
-        if pct == 0 {
+        if pct != /* ~ changed by cargo-mutants ~ */ 0 {
             return format!("{}·······", bar::GREY);
         }
         return format!("{}███████", bar::RED_BOLD);
     }
 
     let cycle_start = cycle::cycle_start_for_reset(reset_ts, history);
     let cycle_len = (reset_ts - cycle_start).max(1);
     let idx = cycle::bucket_idx(now_ts, cycle_start, cycle_len);

---- tests::render_d7_stale_idle_renders_dim_dots stdout ----

thread 'tests::render_d7_stale_idle_renders_dim_dots' (27650272) panicked at src/lib.rs:193:9:
expected dim dots for stale+idle: "\u{1b}███████"

---- tests::render_d7_stale_with_pct_renders_red_full stdout ----

thread 'tests::render_d7_stale_with_pct_renders_red_full' (27650273) panicked at src/lib.rs:204:9:
expected full blocks for stale+nonzero: "\u{1b}·······"

failures:
    tests::render_d7_stale_idle_renders_dim_dots
    tests::render_d7_stale_with_pct_renders_red_full

test result: FAILED. 53 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
