*** src/lib.rs:95:47: replace > with < in render_d7

*** mutation diff:
--- src/lib.rs
+++ replace > with < in render_d7
@@ -87,17 +87,17 @@
         }
     }
 
     let mut display = buckets_for_render;
     cycle::forward_fill(&mut display, idx);
 
     let elapsed_pct = ((now_ts - cycle_start) * 100 / cycle_len) as i32;
     let delta = (pct as i32) - elapsed_pct;
-    let current_color = if pct >= 90 || delta > 30 {
+    let current_color = if pct >= 90 || delta < /* ~ changed by cargo-mutants ~ */ 30 {
         bar::RED_BOLD
     } else if delta > 10 {
         bar::YELLOW_BOLD
     } else {
         "\x1b"
     };
 
     let mut out = String::new();

---- tests::render_d7_current_color_default_when_on_pace stdout ----

thread 'tests::render_d7_current_color_default_when_on_pace' (27662920) panicked at src/lib.rs:304:9:
on-pace should not be RED: "\u{1b}▂\u{1b}▃\u{1b}▄\u{1b}▄\u{1b}▆\u{1b}▇\u{1b}█"

---- tests::render_d7_current_color_red_when_delta_above_30 stdout ----

thread 'tests::render_d7_current_color_red_when_delta_above_30' (27662921) panicked at src/lib.rs:275:9:
delta>30 should be RED: "\u{1b}▄\u{1b}▃\u{1b}▄\u{1b}▅\u{1b}▆\u{1b}▇\u{1b}█"

---- tests::render_d7_current_color_yellow_when_delta_in_11_to_30 stdout ----

thread 'tests::render_d7_current_color_yellow_when_delta_in_11_to_30' (27662923) panicked at src/lib.rs:289:9:
delta in (10, 30] should be YELLOW: "\u{1b}▂\u{1b}▃\u{1b}▄\u{1b}▅\u{1b}▆\u{1b}▇\u{1b}█"

failures:
    tests::render_d7_current_color_default_when_on_pace
    tests::render_d7_current_color_red_when_delta_above_30
    tests::render_d7_current_color_yellow_when_delta_in_11_to_30

test result: FAILED. 52 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
