*** src/main.rs:18:5: replace main with ()

*** mutation diff:
--- src/main.rs
+++ replace main with ()
@@ -10,22 +10,17 @@
 use anyhow::{Context, Result};
 use chrono::Utc;
 use claude_meter::{render, ApiCache, History, StatuslineInput};
 use serde_json::Value;
 use std::env;
 use std::io::{self, Read, Write};
 
 fn main() {
-    if let Err(e) = run() {
-        // A failed render shouldn't break the user's terminal — log to stderr
-        // and exit cleanly so the harness still gets *something* on stdout.
-        eprintln!("claude-meter: {e:#}");
-        std::process::exit(0);
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn run() -> Result<()> {
     let stdin_payload = read_stdin()?;
     let input = parse_input(&stdin_payload)?;
 
     let home = env::var("HOME").context("HOME not set")?;
     let cache_path = format!("{home}/.cache/claude-usage.json");

*** result: Success
