*** src/main.rs:27:5: replace run -> Result<()> with Ok(())

*** mutation diff:
--- src/main.rs
+++ replace run -> Result<()> with Ok(())
@@ -19,38 +19,17 @@
         // A failed render shouldn't break the user's terminal — log to stderr
         // and exit cleanly so the harness still gets *something* on stdout.
         eprintln!("claude-meter: {e:#}");
         std::process::exit(0);
     }
 }
 
 fn run() -> Result<()> {
-    let stdin_payload = read_stdin()?;
-    let input = parse_input(&stdin_payload)?;
-
-    let home = env::var("HOME").context("HOME not set")?;
-    let cache_path = format!("{home}/.cache/claude-usage.json");
-    let history_path = format!("{home}/.cache/claude-usage-history.json");
-
-    let cache_json = std::fs::read_to_string(&cache_path).context("reading cache")?;
-    let cache = ApiCache::parse(&cache_json).context("parsing cache")?;
-
-    let history_json = std::fs::read_to_string(&history_path).unwrap_or_else(|_| "{}".into());
-    let mut history = History::parse(&history_json).unwrap_or_default();
-
-    let output = render(&input, Utc::now(), &cache, &mut history);
-
-    let tmp_path = format!("{history_path}.tmp.{}", std::process::id());
-    std::fs::write(&tmp_path, history.to_json())?;
-    std::fs::rename(&tmp_path, &history_path)?;
-
-    io::stdout().write_all(output.as_bytes())?;
-    io::stdout().write_all(b"\n")?;
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn read_stdin() -> Result<String> {
     let mut s = String::new();
     io::stdin().read_to_string(&mut s)?;
     Ok(s)
 }

*** result: Success
