*** src/bar.rs:13:29: replace * with / in bar

*** mutation diff:
--- src/bar.rs
+++ replace * with / in bar
@@ -5,17 +5,17 @@
 
 /// 8 spark characters from low to high.
 pub const SPARK_CHARS: [char; 8] = ['▁', '▂', '▃', '▄', '▅', '▆', '▇', '█'];
 
 /// Pick a spark character for a percentage in 0..=100.
 /// Matches the bash mapping: `${BARS:$((v * 8 / 101)):1}`.
 pub fn bar(pct: u8) -> char {
     let pct = pct.min(100);
-    let idx = (pct as usize * 8) / 101;
+    let idx = (pct as usize / /* ~ changed by cargo-mutants ~ */ 8) / 101;
     SPARK_CHARS[idx]
 }
 
 // ANSI color escape codes.
 pub const RESET: &str = "\x1b";
 pub const RED_BOLD: &str = "\x1b";
 pub const YELLOW_BOLD: &str = "\x1b";
 pub const GREY: &str = "\x1b";

---- bar::tests::bar_lowest_chars_for_low_pct stdout ----

thread 'bar::tests::bar_lowest_chars_for_low_pct' (28047506) panicked at src/bar.rs:47:9:
assertion `left == right` failed
  left: '▁'
 right: '▂'

---- bar::tests::bar_highest_char_for_full stdout ----

thread 'bar::tests::bar_highest_char_for_full' (28047505) panicked at src/bar.rs:52:9:
assertion `left == right` failed
  left: '▁'
 right: '█'

---- bar::tests::bar_progression_covers_eight_levels stdout ----

thread 'bar::tests::bar_progression_covers_eight_levels' (28047507) panicked at src/bar.rs:61:9:
assertion `left == right` failed: expected all 8 spark levels: got {'▁'}
  left: 1
 right: 8

failures:
    bar::tests::bar_highest_char_for_full
    bar::tests::bar_lowest_chars_for_low_pct
    bar::tests::bar_progression_covers_eight_levels

test result: FAILED. 57 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
