*** src/bar.rs:13:34: replace / with * in bar

*** mutation diff:
--- src/bar.rs
+++ replace / with * in bar
@@ -5,17 +5,17 @@
 
 /// 8 spark characters from low to high.
 pub const SPARK_CHARS: [char; 8] = ['▁', '▂', '▃', '▄', '▅', '▆', '▇', '█'];
 
 /// Pick a spark character for a percentage in 0..=100.
 /// Matches the bash mapping: `${BARS:$((v * 8 / 101)):1}`.
 pub fn bar(pct: u8) -> char {
     let pct = pct.min(100);
-    let idx = (pct as usize * 8) / 101;
+    let idx = (pct as usize * 8) * /* ~ changed by cargo-mutants ~ */ 101;
     SPARK_CHARS[idx]
 }
 
 // ANSI color escape codes.
 pub const RESET: &str = "\x1b";
 pub const RED_BOLD: &str = "\x1b";
 pub const YELLOW_BOLD: &str = "\x1b";
 pub const GREY: &str = "\x1b";

---- bar::tests::bar_lowest_chars_for_low_pct stdout ----

thread 'bar::tests::bar_lowest_chars_for_low_pct' (28047203) panicked at src/bar.rs:14:5:
index out of bounds: the len is 8 but the index is 9696

---- bar::tests::bar_highest_char_for_full stdout ----

thread 'bar::tests::bar_highest_char_for_full' (28047202) panicked at src/bar.rs:14:5:
index out of bounds: the len is 8 but the index is 80800

---- bar::tests::bar_progression_covers_eight_levels stdout ----

thread 'bar::tests::bar_progression_covers_eight_levels' (28047204) panicked at src/bar.rs:14:5:
index out of bounds: the len is 8 but the index is 808

failures:
    bar::tests::bar_highest_char_for_full
    bar::tests::bar_lowest_chars_for_low_pct
    bar::tests::bar_progression_covers_eight_levels
    tests::render_d7_at_delta_exactly_10_is_default_not_yellow
    tests::render_d7_at_delta_exactly_30_is_yellow_not_red
    tests::render_d7_at_exact_reset_does_not_emit_stale_signature
    tests::render_d7_at_exact_reset_is_not_stale
    tests::render_d7_baseline_uses_expected_per_cell_progression
    tests::render_d7_current_color_default_when_on_pace
    tests::render_d7_current_color_red_when_delta_above_30
    tests::render_d7_current_color_red_when_pct_at_or_above_90
    tests::render_d7_current_color_yellow_when_delta_in_11_to_30

test result: FAILED. 40 passed; 20 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
