*** src/bar.rs:27:12: replace >= with < in ctx_color

*** mutation diff:
--- src/bar.rs
+++ replace >= with < in ctx_color
@@ -19,17 +19,17 @@
 pub const RED_BOLD: &str = "\x1b";
 pub const YELLOW_BOLD: &str = "\x1b";
 pub const GREY: &str = "\x1b";
 pub const DIM: &str = "\x1b";
 pub const PAST: &str = "\x1b";
 
 /// Color tier for the context-window bar.
 pub fn ctx_color(pct: u8) -> &'static str {
-    if pct >= 80 { RED_BOLD }
+    if pct < /* ~ changed by cargo-mutants ~ */ 80 { RED_BOLD }
     else if pct >= 50 { YELLOW_BOLD }
     else { GREY }
 }
 
 /// Color tier for pace warnings (delta = utilization - elapsed%).
 pub fn pace_color(delta: i32) -> &'static str {
     if delta > 30 { RED_BOLD }
     else if delta > 10 { YELLOW_BOLD }

---- bar::tests::ctx_color_red_at_80_and_above stdout ----

thread 'bar::tests::ctx_color_red_at_80_and_above' (28051099) panicked at src/bar.rs:78:9:
assertion `left == right` failed
  left: "\u{1b}"
 right: "\u{1b}"

---- bar::tests::ctx_color_grey_below_50 stdout ----

thread 'bar::tests::ctx_color_grey_below_50' (28051098) panicked at src/bar.rs:66:9:
assertion `left == right` failed
  left: "\u{1b}"
 right: "\u{1b}"

---- bar::tests::ctx_color_yellow_at_50_through_79 stdout ----

thread 'bar::tests::ctx_color_yellow_at_50_through_79' (28051100) panicked at src/bar.rs:72:9:
assertion `left == right` failed
  left: "\u{1b}"
 right: "\u{1b}"

failures:
    bar::tests::ctx_color_grey_below_50
    bar::tests::ctx_color_red_at_80_and_above
    bar::tests::ctx_color_yellow_at_50_through_79

test result: FAILED. 57 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
