*** src/bar.rs:34:14: replace > with < in pace_color

*** mutation diff:
--- src/bar.rs
+++ replace > with < in pace_color
@@ -26,17 +26,17 @@
 pub fn ctx_color(pct: u8) -> &'static str {
     if pct >= 80 { RED_BOLD }
     else if pct >= 50 { YELLOW_BOLD }
     else { GREY }
 }
 
 /// Color tier for pace warnings (delta = utilization - elapsed%).
 pub fn pace_color(delta: i32) -> &'static str {
-    if delta > 30 { RED_BOLD }
+    if delta < /* ~ changed by cargo-mutants ~ */ 30 { RED_BOLD }
     else if delta > 10 { YELLOW_BOLD }
     else { GREY }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;

---- bar::tests::pace_color_red_above_30 stdout ----

thread 'bar::tests::pace_color_red_above_30' (28055315) panicked at src/bar.rs:97:9:
assertion `left == right` failed
  left: "\u{1b}"
 right: "\u{1b}"

---- bar::tests::pace_color_grey_at_low_delta stdout ----

thread 'bar::tests::pace_color_grey_at_low_delta' (28055314) panicked at src/bar.rs:84:9:
assertion `left == right` failed
  left: "\u{1b}"
 right: "\u{1b}"

---- bar::tests::pace_color_yellow_above_10_through_30 stdout ----

thread 'bar::tests::pace_color_yellow_above_10_through_30' (28055316) panicked at src/bar.rs:91:9:
assertion `left == right` failed
  left: "\u{1b}"
 right: "\u{1b}"

failures:
    bar::tests::pace_color_grey_at_low_delta
    bar::tests::pace_color_red_above_30
    bar::tests::pace_color_yellow_above_10_through_30
    tests::render_h5_below_90_uses_pace_color_not_red
    tests::render_h5_elapsed_pct_division_pinned
    tests::render_h5_yellow_when_pace_delta_above_10

test result: FAILED. 54 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
