*** src/bar.rs:35:19: replace > with >= in pace_color

*** mutation diff:
--- src/bar.rs
+++ replace > with >= in pace_color
@@ -27,17 +27,17 @@
     if pct >= 80 { RED_BOLD }
     else if pct >= 50 { YELLOW_BOLD }
     else { GREY }
 }
 
 /// Color tier for pace warnings (delta = utilization - elapsed%).
 pub fn pace_color(delta: i32) -> &'static str {
     if delta > 30 { RED_BOLD }
-    else if delta > 10 { YELLOW_BOLD }
+    else if delta >= /* ~ changed by cargo-mutants ~ */ 10 { YELLOW_BOLD }
     else { GREY }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]

---- bar::tests::pace_color_grey_at_low_delta stdout ----

thread 'bar::tests::pace_color_grey_at_low_delta' (28058062) panicked at src/bar.rs:86:9:
assertion `left == right` failed
  left: "\u{1b}"
 right: "\u{1b}"

failures:
    bar::tests::pace_color_grey_at_low_delta

test result: FAILED. 59 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
