*** src/cycle.rs:36:5: replace cycle_start_for_reset -> i64 with 1

*** mutation diff:
--- src/cycle.rs
+++ replace cycle_start_for_reset -> i64 with 1
@@ -28,27 +28,17 @@
 ///
 /// **Critical:** the `+ TOLERANCE` exclusion prevents the cycle's OWN
 /// stored reset (jittered by the API by a second or two) from being
 /// selected as "previous." That bug collapsed cycle_start to ~now,
 /// pinned bucket index to 0, and combined with the daily-max guard
 /// caused the leftmost bar to grow on every render. See the
 /// `drift_does_not_collapse_idx_to_zero` outer test.
 pub fn cycle_start_for_reset(reset_ts: i64, history: &History) -> i64 {
-    let prev = history
-        .cycles
-        .iter()
-        .map(|c| c.reset)
-        .filter(|&r| r + CYCLE_MATCH_TOLERANCE_S < reset_ts)
-        .max();
-
-    match prev {
-        Some(p) if reset_ts - p <= SEVEN_DAYS_S + CYCLE_MATCH_TOLERANCE_S => p,
-        _ => reset_ts - SEVEN_DAYS_S,
-    }
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Compute the bucket index for `now` within a cycle running from
 /// `cycle_start` to `cycle_start + cycle_len`. Returns 0..=6.
 pub fn bucket_idx(now: i64, cycle_start: i64, cycle_len: i64) -> usize {
     let bucket_size = (cycle_len / 7).max(60);
     let elapsed = (now - cycle_start).max(0);
     ((elapsed / bucket_size) as usize).min(6)

---- cycle::tests::cycle_start_excludes_stored_reset_within_drift_tolerance stdout ----

thread 'cycle::tests::cycle_start_excludes_stored_reset_within_drift_tolerance' (28062102) panicked at src/cycle.rs:147:9:
assertion `left == right` failed
  left: 1
 right: 1777446000

---- cycle::tests::cycle_start_falls_back_just_past_7d_plus_tolerance stdout ----

thread 'cycle::tests::cycle_start_falls_back_just_past_7d_plus_tolerance' (28062103) panicked at src/cycle.rs:193:9:
assertion `left == right` failed: should cold-start when prev is past 7d + tolerance gate
  left: 1
 right: 1700000061

---- cycle::tests::cycle_start_falls_back_when_prev_more_than_7d_ago stdout ----

thread 'cycle::tests::cycle_start_falls_back_when_prev_more_than_7d_ago' (28062105) panicked at src/cycle.rs:131:9:
assertion `left == right` failed
  left: 1
 right: 1777446000

failures:
    cycle::tests::cycle_start_excludes_stored_reset_at_exactly_60s_drift
    cycle::tests::cycle_start_excludes_stored_reset_within_drift_tolerance
    cycle::tests::cycle_start_falls_back_just_past_7d_plus_tolerance
    cycle::tests::cycle_start_falls_back_when_no_prior_cycle
    cycle::tests::cycle_start_falls_back_when_prev_more_than_7d_ago
    cycle::tests::cycle_start_includes_reset_just_past_drift_tolerance
    cycle::tests::cycle_start_tolerates_7d_gate_drift
    cycle::tests::cycle_start_uses_prev_at_exact_7d_plus_tolerance
    cycle::tests::cycle_start_uses_prev_reset_when_within_7d
    tests::render_d7_at_delta_exactly_30_is_yellow_not_red
    tests::render_d7_baseline_uses_expected_per_cell_progression
    tests::render_d7_current_color_red_when_delta_above_30

test result: FAILED. 46 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
