*** src/cycle.rs:40:24: replace + with * in cycle_start_for_reset

*** mutation diff:
--- src/cycle.rs
+++ replace + with * in cycle_start_for_reset
@@ -32,17 +32,17 @@
 /// pinned bucket index to 0, and combined with the daily-max guard
 /// caused the leftmost bar to grow on every render. See the
 /// `drift_does_not_collapse_idx_to_zero` outer test.
 pub fn cycle_start_for_reset(reset_ts: i64, history: &History) -> i64 {
     let prev = history
         .cycles
         .iter()
         .map(|c| c.reset)
-        .filter(|&r| r + CYCLE_MATCH_TOLERANCE_S < reset_ts)
+        .filter(|&r| r * /* ~ changed by cargo-mutants ~ */ CYCLE_MATCH_TOLERANCE_S < reset_ts)
         .max();
 
     match prev {
         Some(p) if reset_ts - p <= SEVEN_DAYS_S + CYCLE_MATCH_TOLERANCE_S => p,
         _ => reset_ts - SEVEN_DAYS_S,
     }
 }

---- cycle::tests::cycle_start_excludes_stored_reset_within_drift_tolerance stdout ----

thread 'cycle::tests::cycle_start_excludes_stored_reset_within_drift_tolerance' (28067153) panicked at src/cycle.rs:157:9:
assertion `left == right` failed
  left: 1777446001
 right: 1777446000

---- cycle::tests::cycle_start_excludes_stored_reset_at_exactly_60s_drift stdout ----

thread 'cycle::tests::cycle_start_excludes_stored_reset_at_exactly_60s_drift' (28067152) panicked at src/cycle.rs:169:9:
assertion `left == right` failed: 60s drift should still exclude same-cycle reset
  left: 1777446060
 right: 1777446000

---- cycle::tests::cycle_start_includes_reset_just_past_drift_tolerance stdout ----

thread 'cycle::tests::cycle_start_includes_reset_just_past_drift_tolerance' (28067160) panicked at src/cycle.rs:181:9:
assertion `left == right` failed
  left: 1777446061
 right: 1778050800

failures:
    cycle::tests::cycle_start_excludes_stored_reset_at_exactly_60s_drift
    cycle::tests::cycle_start_excludes_stored_reset_within_drift_tolerance
    cycle::tests::cycle_start_includes_reset_just_past_drift_tolerance
    cycle::tests::cycle_start_tolerates_7d_gate_drift
    cycle::tests::cycle_start_uses_prev_at_exact_7d_plus_tolerance

test result: FAILED. 55 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
