*** src/cycle.rs:40:50: replace < with <= in cycle_start_for_reset

*** mutation diff:
--- src/cycle.rs
+++ replace < with <= in cycle_start_for_reset
@@ -32,17 +32,17 @@
 /// pinned bucket index to 0, and combined with the daily-max guard
 /// caused the leftmost bar to grow on every render. See the
 /// `drift_does_not_collapse_idx_to_zero` outer test.
 pub fn cycle_start_for_reset(reset_ts: i64, history: &History) -> i64 {
     let prev = history
         .cycles
         .iter()
         .map(|c| c.reset)
-        .filter(|&r| r + CYCLE_MATCH_TOLERANCE_S < reset_ts)
+        .filter(|&r| r + CYCLE_MATCH_TOLERANCE_S <= /* ~ changed by cargo-mutants ~ */ reset_ts)
         .max();
 
     match prev {
         Some(p) if reset_ts - p <= SEVEN_DAYS_S + CYCLE_MATCH_TOLERANCE_S => p,
         _ => reset_ts - SEVEN_DAYS_S,
     }
 }

---- cycle::tests::cycle_start_excludes_stored_reset_at_exactly_60s_drift stdout ----

thread 'cycle::tests::cycle_start_excludes_stored_reset_at_exactly_60s_drift' (28065515) panicked at src/cycle.rs:169:9:
assertion `left == right` failed: 60s drift should still exclude same-cycle reset
  left: 1778050800
 right: 1777446000

failures:
    cycle::tests::cycle_start_excludes_stored_reset_at_exactly_60s_drift

test result: FAILED. 59 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
