*** src/cycle.rs:44:20: replace match guard reset_ts - p <= SEVEN_DAYS_S + CYCLE_MATCH_TOLERANCE_S with false in cycle_start_for_reset

*** mutation diff:
--- src/cycle.rs
+++ replace match guard reset_ts - p <= SEVEN_DAYS_S + CYCLE_MATCH_TOLERANCE_S with false in cycle_start_for_reset
@@ -36,17 +36,17 @@
     let prev = history
         .cycles
         .iter()
         .map(|c| c.reset)
         .filter(|&r| r + CYCLE_MATCH_TOLERANCE_S < reset_ts)
         .max();
 
     match prev {
-        Some(p) if reset_ts - p <= SEVEN_DAYS_S + CYCLE_MATCH_TOLERANCE_S => p,
+        Some(p) if false /* ~ changed by cargo-mutants ~ */ => p,
         _ => reset_ts - SEVEN_DAYS_S,
     }
 }
 
 /// Compute the bucket index for `now` within a cycle running from
 /// `cycle_start` to `cycle_start + cycle_len`. Returns 0..=6.
 pub fn bucket_idx(now: i64, cycle_start: i64, cycle_len: i64) -> usize {
     let bucket_size = (cycle_len / 7).max(60);

---- cycle::tests::cycle_start_excludes_stored_reset_within_drift_tolerance stdout ----

thread 'cycle::tests::cycle_start_excludes_stored_reset_within_drift_tolerance' (28068838) panicked at src/cycle.rs:157:9:
assertion `left == right` failed
  left: 1777446001
 right: 1777446000

---- cycle::tests::cycle_start_includes_reset_just_past_drift_tolerance stdout ----

thread 'cycle::tests::cycle_start_includes_reset_just_past_drift_tolerance' (28068842) panicked at src/cycle.rs:181:9:
assertion `left == right` failed
  left: 1777446061
 right: 1778050800

---- cycle::tests::cycle_start_excludes_stored_reset_at_exactly_60s_drift stdout ----

thread 'cycle::tests::cycle_start_excludes_stored_reset_at_exactly_60s_drift' (28068837) panicked at src/cycle.rs:169:9:
assertion `left == right` failed: 60s drift should still exclude same-cycle reset
  left: 1777446060
 right: 1777446000

failures:
    cycle::tests::cycle_start_excludes_stored_reset_at_exactly_60s_drift
    cycle::tests::cycle_start_excludes_stored_reset_within_drift_tolerance
    cycle::tests::cycle_start_includes_reset_just_past_drift_tolerance
    cycle::tests::cycle_start_tolerates_7d_gate_drift
    cycle::tests::cycle_start_uses_prev_at_exact_7d_plus_tolerance

test result: FAILED. 55 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
