*** src/cycle.rs:44:29: replace - with / in cycle_start_for_reset

*** mutation diff:
--- src/cycle.rs
+++ replace - with / in cycle_start_for_reset
@@ -36,17 +36,17 @@
     let prev = history
         .cycles
         .iter()
         .map(|c| c.reset)
         .filter(|&r| r + CYCLE_MATCH_TOLERANCE_S < reset_ts)
         .max();
 
     match prev {
-        Some(p) if reset_ts - p <= SEVEN_DAYS_S + CYCLE_MATCH_TOLERANCE_S => p,
+        Some(p) if reset_ts / /* ~ changed by cargo-mutants ~ */ p <= SEVEN_DAYS_S + CYCLE_MATCH_TOLERANCE_S => p,
         _ => reset_ts - SEVEN_DAYS_S,
     }
 }
 
 /// Compute the bucket index for `now` within a cycle running from
 /// `cycle_start` to `cycle_start + cycle_len`. Returns 0..=6.
 pub fn bucket_idx(now: i64, cycle_start: i64, cycle_len: i64) -> usize {
     let bucket_size = (cycle_len / 7).max(60);

---- cycle::tests::cycle_start_falls_back_just_past_7d_plus_tolerance stdout ----

thread 'cycle::tests::cycle_start_falls_back_just_past_7d_plus_tolerance' (28071519) panicked at src/cycle.rs:203:9:
assertion `left == right` failed: should cold-start when prev is past 7d + tolerance gate
  left: 1700000000
 right: 1700000061

---- cycle::tests::cycle_start_falls_back_when_prev_more_than_7d_ago stdout ----

thread 'cycle::tests::cycle_start_falls_back_when_prev_more_than_7d_ago' (28071521) panicked at src/cycle.rs:141:9:
assertion `left == right` failed
  left: 1700000000
 right: 1777446000

failures:
    cycle::tests::cycle_start_falls_back_just_past_7d_plus_tolerance
    cycle::tests::cycle_start_falls_back_when_prev_more_than_7d_ago

test result: FAILED. 58 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
