*** src/cycle.rs:54:15: replace / with * in bucket_idx

*** mutation diff:
--- src/cycle.rs
+++ replace / with * in bucket_idx
@@ -46,17 +46,17 @@
     }
 }
 
 /// Compute the bucket index for `now` within a cycle running from
 /// `cycle_start` to `cycle_start + cycle_len`. Returns 0..=6.
 pub fn bucket_idx(now: i64, cycle_start: i64, cycle_len: i64) -> usize {
     let bucket_size = (cycle_len / 7).max(60);
     let elapsed = (now - cycle_start).max(0);
-    ((elapsed / bucket_size) as usize).min(6)
+    ((elapsed * /* ~ changed by cargo-mutants ~ */ bucket_size) as usize).min(6)
 }
 
 /// Locate the cycle in history matching `reset_ts` within tolerance.
 /// Returns the cycle's index in `history.cycles` if found.
 pub fn match_cycle(reset_ts: i64, history: &History) -> Option<usize> {
     history
         .cycles
         .iter()

---- cycle::tests::bucket_idx_floors_minimum_bucket_size stdout ----

thread 'cycle::tests::bucket_idx_floors_minimum_bucket_size' (28082565) panicked at src/cycle.rs:251:9:
assertion `left == right` failed
  left: 6
 right: 2

---- cycle::tests::bucket_idx_partitions_seven_days_correctly stdout ----

thread 'cycle::tests::bucket_idx_partitions_seven_days_correctly' (28082566) panicked at src/cycle.rs:243:9:
assertion `left == right` failed
  left: 6
 right: 4

---- tests::render_d7_only_current_bucket_uses_current_color stdout ----

thread 'tests::render_d7_only_current_bucket_uses_current_color' (28082601) panicked at src/lib.rs:241:9:
assertion `left == right` failed: expected exactly 3 PAST-colored cells: "\u{1b}▁\u{1b}▂\u{1b}▃\u{1b}▄\u{1b}▄\u{1b}▄\u{1b}▄"
  left: 6
 right: 3

failures:
    cycle::tests::bucket_idx_floors_minimum_bucket_size
    cycle::tests::bucket_idx_partitions_seven_days_correctly
    tests::render_d7_only_current_bucket_uses_current_color

test result: FAILED. 57 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
