*** src/cycle.rs:63:32: replace - with / in match_cycle

*** mutation diff:
--- src/cycle.rs
+++ replace - with / in match_cycle
@@ -55,17 +55,17 @@
 }
 
 /// Locate the cycle in history matching `reset_ts` within tolerance.
 /// Returns the cycle's index in `history.cycles` if found.
 pub fn match_cycle(reset_ts: i64, history: &History) -> Option<usize> {
     history
         .cycles
         .iter()
-        .position(|c| (c.reset - reset_ts).abs() <= CYCLE_MATCH_TOLERANCE_S)
+        .position(|c| (c.reset / /* ~ changed by cargo-mutants ~ */ reset_ts).abs() <= CYCLE_MATCH_TOLERANCE_S)
 }
 
 /// Update the bucket at `idx` with `pct` using the daily-peak rule:
 /// keep `max(stored, pct)`. Returns the new value stored.
 ///
 /// This is the per-day peak invariant. Multiple renders during a single
 /// day can vary in the reported `pct` (rolling-window noise, mid-day
 /// dips); we keep only the highest. See the

---- cycle::tests::match_cycle_finds_within_60s_either_direction stdout ----

thread 'cycle::tests::match_cycle_finds_within_60s_either_direction' (28088322) panicked at src/cycle.rs:262:9:
assertion `left == right` failed
  left: Some(0)
 right: Some(1)

---- cycle::tests::match_cycle_misses_just_outside_tolerance stdout ----

thread 'cycle::tests::match_cycle_misses_just_outside_tolerance' (28088323) panicked at src/cycle.rs:270:9:
assertion `left == right` failed
  left: Some(0)
 right: None

failures:
    cycle::tests::match_cycle_finds_within_60s_either_direction
    cycle::tests::match_cycle_misses_just_outside_tolerance

test result: FAILED. 58 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
