*** src/cycle.rs:74:5: replace apply_max_guard -> u8 with 1

*** mutation diff:
--- src/cycle.rs
+++ replace apply_max_guard -> u8 with 1
@@ -66,22 +66,17 @@
 /// Update the bucket at `idx` with `pct` using the daily-peak rule:
 /// keep `max(stored, pct)`. Returns the new value stored.
 ///
 /// This is the per-day peak invariant. Multiple renders during a single
 /// day can vary in the reported `pct` (rolling-window noise, mid-day
 /// dips); we keep only the highest. See the
 /// `max_guard_keeps_daily_peak_across_intraday_renders` outer test.
 pub fn apply_max_guard(buckets: &mut [Option<u8>; 7], idx: usize, pct: u8) -> u8 {
-    let new = match buckets[idx] {
-        Some(stored) => stored.max(pct),
-        None => pct,
-    };
-    buckets[idx] = Some(new);
-    new
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Append a brand-new cycle entry to history with `pct` written at `idx`.
 pub fn append_new_cycle(history: &mut History, reset_ts: i64, idx: usize, pct: u8) {
     let mut buckets: [Option<u8>; 7] = [None; 7];
     buckets[idx] = Some(pct);
     history.cycles.push(Cycle { reset: reset_ts, buckets });
 }

---- cycle::tests::max_guard_overwrites_lower_stored_value stdout ----

thread 'cycle::tests::max_guard_overwrites_lower_stored_value' (28090928) panicked at src/cycle.rs:296:9:
assertion `left == right` failed
  left: Some(30)
 right: Some(50)

---- cycle::tests::max_guard_writes_pct_when_bucket_empty stdout ----

thread 'cycle::tests::max_guard_writes_pct_when_bucket_empty' (28090929) panicked at src/cycle.rs:280:9:
assertion `left == right` failed
  left: None
 right: Some(42)

---- tests::render_d7_at_delta_exactly_30_is_yellow_not_red stdout ----

thread 'tests::render_d7_at_delta_exactly_30_is_yellow_not_red' (28090940) panicked at src/lib.rs:431:9:
delta==30 → YELLOW: "\u{1b}▂\u{1b}▃\u{1b}▄\u{1b}▅\u{1b}▆\u{1b}▇\u{1b}█"

failures:
    cycle::tests::max_guard_overwrites_lower_stored_value
    cycle::tests::max_guard_writes_pct_when_bucket_empty
    tests::render_d7_at_delta_exactly_30_is_yellow_not_red
    tests::render_d7_current_color_red_when_delta_above_30
    tests::render_d7_current_color_red_when_pct_at_or_above_90
    tests::render_d7_current_color_yellow_when_delta_in_11_to_30

test result: FAILED. 54 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
