*** src/cycle.rs:84:5: replace append_new_cycle with ()

*** mutation diff:
--- src/cycle.rs
+++ replace append_new_cycle with ()
@@ -76,19 +76,17 @@
         None => pct,
     };
     buckets[idx] = Some(new);
     new
 }
 
 /// Append a brand-new cycle entry to history with `pct` written at `idx`.
 pub fn append_new_cycle(history: &mut History, reset_ts: i64, idx: usize, pct: u8) {
-    let mut buckets: [Option<u8>; 7] = [None; 7];
-    buckets[idx] = Some(pct);
-    history.cycles.push(Cycle { reset: reset_ts, buckets });
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Forward-fill nulls in past positions for rendering. A null past bucket
 /// means we made no observation that day; we inherit the prior day's value
 /// as a lower bound rather than rendering a misleading zero.
 ///
 /// Only operates on positions `1..=current_idx`. The "current" and "future"
 /// positions are left untouched.

---- cycle::tests::append_new_cycle_creates_fresh_entry_at_end stdout ----

thread 'cycle::tests::append_new_cycle_creates_fresh_entry_at_end' (28091671) panicked at src/cycle.rs:316:9:
assertion `left == right` failed
  left: 1
 right: 2

---- tests::render_d7_at_exact_reset_does_not_emit_stale_signature stdout ----

thread 'tests::render_d7_at_exact_reset_does_not_emit_stale_signature' (28091721) panicked at src/lib.rs:86:56:
called `Option::unwrap()` on a `None` value

---- tests::render_d7_at_exact_reset_is_not_stale stdout ----

thread 'tests::render_d7_at_exact_reset_is_not_stale' (28091722) panicked at src/lib.rs:86:56:
called `Option::unwrap()` on a `None` value

failures:
    cycle::tests::append_new_cycle_creates_fresh_entry_at_end
    tests::render_d7_at_exact_reset_does_not_emit_stale_signature
    tests::render_d7_at_exact_reset_is_not_stale
    tests::render_d7_baseline_uses_expected_per_cell_progression

test result: FAILED. 56 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
