*** src/cycle.rs:98:36: replace - with + in forward_fill

*** mutation diff:
--- src/cycle.rs
+++ replace - with + in forward_fill
@@ -90,17 +90,17 @@
 /// means we made no observation that day; we inherit the prior day's value
 /// as a lower bound rather than rendering a misleading zero.
 ///
 /// Only operates on positions `1..=current_idx`. The "current" and "future"
 /// positions are left untouched.
 pub fn forward_fill(buckets: &mut [Option<u8>; 7], current_idx: usize) {
     for i in 1..=current_idx.min(6) {
         if buckets[i].is_none() {
-            buckets[i] = buckets[i - 1];
+            buckets[i] = buckets[i + /* ~ changed by cargo-mutants ~ */ 1];
         }
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::history::Cycle;

---- cycle::tests::forward_fill_inherits_through_nulls stdout ----

thread 'cycle::tests::forward_fill_inherits_through_nulls' (28093465) panicked at src/cycle.rs:331:9:
assertion `left == right` failed
  left: [Some(20), None, Some(30), Some(30), None, None, None]
 right: [Some(20), Some(20), Some(20), Some(30), Some(30), None, None]

---- cycle::tests::forward_fill_leaves_leading_null_alone stdout ----

thread 'cycle::tests::forward_fill_leaves_leading_null_alone' (28093466) panicked at src/cycle.rs:350:9:
assertion `left == right` failed
  left: [None, Some(20), None, None, None, None, None]
 right: [None, Some(20), Some(20), Some(20), None, None, None]

failures:
    cycle::tests::forward_fill_inherits_through_nulls
    cycle::tests::forward_fill_leaves_leading_null_alone

test result: FAILED. 58 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
