*** src/history.rs:28:9: replace History::to_json -> String with "xyzzy".into()

*** mutation diff:
--- src/history.rs
+++ replace History::to_json -> String with "xyzzy".into()
@@ -20,17 +20,17 @@
 }
 
 impl History {
     pub fn parse(json: &str) -> anyhow::Result<Self> {
         Ok(serde_json::from_str(json)?)
     }
 
     pub fn to_json(&self) -> String {
-        serde_json::to_string(self).expect("history serializes")
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]

---- history::tests::to_json_round_trips stdout ----

thread 'history::tests::to_json_round_trips' (28095481) panicked at src/history.rs:73:40:
called `Result::unwrap()` on an `Err` value: expected value at line 1 column 1

---- history::tests::to_json_emits_cycles_key_with_reset_value stdout ----

thread 'history::tests::to_json_emits_cycles_key_with_reset_value' (28095480) panicked at src/history.rs:83:9:
json missing 'cycles' key: xyzzy

failures:
    history::tests::to_json_emits_cycles_key_with_reset_value
    history::tests::to_json_round_trips

test result: FAILED. 58 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
