*** src/lib.rs:107:36: replace + with - in render_d7

*** mutation diff:
--- src/lib.rs
+++ replace + with - in render_d7
@@ -99,17 +99,17 @@
     } else {
         "\x1b"
     };
 
     let mut out = String::new();
     for (i, cell) in display.iter().enumerate() {
         match cell {
             None => {
-                let expected = ((i + 1) * 100 / 7) as u8;
+                let expected = ((i - /* ~ changed by cargo-mutants ~ */ 1) * 100 / 7) as u8;
                 out.push_str(bar::DIM);
                 out.push(bar::bar(expected));
             }
             Some(v) if i == idx => {
                 out.push_str(current_color);
                 out.push(bar::bar(*v));
             }
             Some(v) => {

---- tests::render_d7_at_exact_reset_is_not_stale stdout ----

thread 'tests::render_d7_at_exact_reset_is_not_stale' (28013254) panicked at src/lib.rs:107:33:
attempt to subtract with overflow

---- tests::render_d7_at_delta_exactly_30_is_yellow_not_red stdout ----

thread 'tests::render_d7_at_delta_exactly_30_is_yellow_not_red' (28013252) panicked at src/lib.rs:107:33:
attempt to subtract with overflow

---- tests::render_d7_at_exact_reset_does_not_emit_stale_signature stdout ----

thread 'tests::render_d7_at_exact_reset_does_not_emit_stale_signature' (28013253) panicked at src/lib.rs:107:33:
attempt to subtract with overflow

failures:
    tests::render_d7_at_delta_exactly_10_is_default_not_yellow
    tests::render_d7_at_delta_exactly_30_is_yellow_not_red
    tests::render_d7_at_exact_reset_does_not_emit_stale_signature
    tests::render_d7_at_exact_reset_is_not_stale
    tests::render_d7_baseline_uses_expected_per_cell_progression
    tests::render_d7_current_color_default_when_on_pace
    tests::render_d7_current_color_red_when_pct_at_or_above_90
    tests::render_d7_current_color_yellow_when_delta_in_11_to_30

test result: FAILED. 52 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
