*** src/lib.rs:107:36: replace + with * in render_d7

*** mutation diff:
--- src/lib.rs
+++ replace + with * in render_d7
@@ -99,17 +99,17 @@
     } else {
         "\x1b"
     };
 
     let mut out = String::new();
     for (i, cell) in display.iter().enumerate() {
         match cell {
             None => {
-                let expected = ((i + 1) * 100 / 7) as u8;
+                let expected = ((i * /* ~ changed by cargo-mutants ~ */ 1) * 100 / 7) as u8;
                 out.push_str(bar::DIM);
                 out.push(bar::bar(expected));
             }
             Some(v) if i == idx => {
                 out.push_str(current_color);
                 out.push(bar::bar(*v));
             }
             Some(v) => {

---- tests::render_d7_baseline_uses_expected_per_cell_progression stdout ----

thread 'tests::render_d7_baseline_uses_expected_per_cell_progression' (28014475) panicked at src/lib.rs:397:9:
expected baseline chars "▃▄▅▆▇█" (positions 1..=6) in: "▁▂▃▄▅▆▇"

failures:
    tests::render_d7_baseline_uses_expected_per_cell_progression

test result: FAILED. 59 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
