*** src/lib.rs:111:24: replace match guard i == idx with false in render_d7

*** mutation diff:
--- src/lib.rs
+++ replace match guard i == idx with false in render_d7
@@ -103,17 +103,17 @@
     let mut out = String::new();
     for (i, cell) in display.iter().enumerate() {
         match cell {
             None => {
                 let expected = ((i + 1) * 100 / 7) as u8;
                 out.push_str(bar::DIM);
                 out.push(bar::bar(expected));
             }
-            Some(v) if i == idx => {
+            Some(v) if false /* ~ changed by cargo-mutants ~ */ => {
                 out.push_str(current_color);
                 out.push(bar::bar(*v));
             }
             Some(v) => {
                 out.push_str(bar::PAST);
                 out.push(bar::bar(*v));
             }
         }

---- tests::render_d7_at_delta_exactly_30_is_yellow_not_red stdout ----

thread 'tests::render_d7_at_delta_exactly_30_is_yellow_not_red' (28008125) panicked at src/lib.rs:431:9:
delta==30 → YELLOW: "\u{1b}▂\u{1b}▃\u{1b}▄\u{1b}▇\u{1b}▆\u{1b}▇\u{1b}█"

---- tests::render_d7_current_color_red_when_delta_above_30 stdout ----

thread 'tests::render_d7_current_color_red_when_delta_above_30' (28008130) panicked at src/lib.rs:275:9:
delta>30 should be RED: "\u{1b}▄\u{1b}▃\u{1b}▄\u{1b}▅\u{1b}▆\u{1b}▇\u{1b}█"

---- tests::render_d7_current_color_red_when_pct_at_or_above_90 stdout ----

thread 'tests::render_d7_current_color_red_when_pct_at_or_above_90' (28008131) panicked at src/lib.rs:260:9:
pct=90 should produce RED current_color: "\u{1b}▂\u{1b}█\u{1b}▄\u{1b}▅\u{1b}▆\u{1b}▇\u{1b}█"

failures:
    tests::render_d7_at_delta_exactly_30_is_yellow_not_red
    tests::render_d7_current_color_red_when_delta_above_30
    tests::render_d7_current_color_red_when_pct_at_or_above_90
    tests::render_d7_current_color_yellow_when_delta_in_11_to_30
    tests::render_d7_only_current_bucket_uses_current_color

test result: FAILED. 55 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
