*** src/lib.rs:131:15: replace > with < in render_h5

*** mutation diff:
--- src/lib.rs
+++ replace > with < in render_h5
@@ -123,17 +123,17 @@
 
 /// Render the H5 five-hour bar with pace coloring.
 fn render_h5(window: &Window, now_ts: i64) -> String {
     let pct = window.utilization as u8;
     let reset_ts = match window.resets_at {
         Some(dt) => dt.timestamp(),
         None => return format!("{}{}", bar::PAST, bar::bar(pct)),
     };
-    if now_ts > reset_ts {
+    if now_ts < /* ~ changed by cargo-mutants ~ */ reset_ts {
         if pct == 0 {
             return format!("{}{}", bar::GREY, bar::bar(0));
         }
         return format!("{}{}", bar::RED_BOLD, bar::bar(100));
     }
     if pct >= 90 {
         return format!("{}{}", bar::RED_BOLD, bar::bar(pct));
     }

---- tests::render_h5_below_90_uses_pace_color_not_red stdout ----

thread 'tests::render_h5_below_90_uses_pace_color_not_red' (28021285) panicked at src/lib.rs:350:9:
pct=89 with on-pace delta should NOT be RED: "\u{1b}█"

---- tests::render_h5_stale_with_pct_renders_red_full_bar stdout ----

thread 'tests::render_h5_stale_with_pct_renders_red_full_bar' (28021291) panicked at src/lib.rs:323:9:
assertion `left == right` failed
  left: "\u{1b}▄"
 right: "\u{1b}█"

---- tests::render_h5_yellow_when_pace_delta_above_10 stdout ----

thread 'tests::render_h5_yellow_when_pace_delta_above_10' (28021292) panicked at src/lib.rs:362:9:
delta in (10, 30] should be YELLOW: "\u{1b}█"

failures:
    tests::render_h5_below_90_uses_pace_color_not_red
    tests::render_h5_elapsed_pct_division_pinned
    tests::render_h5_stale_with_pct_renders_red_full_bar
    tests::render_h5_yellow_when_pace_delta_above_10

test result: FAILED. 56 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
