*** src/lib.rs:141:38: replace / with * in render_h5

*** mutation diff:
--- src/lib.rs
+++ replace / with * in render_h5
@@ -133,17 +133,17 @@
             return format!("{}{}", bar::GREY, bar::bar(0));
         }
         return format!("{}{}", bar::RED_BOLD, bar::bar(100));
     }
     if pct >= 90 {
         return format!("{}{}", bar::RED_BOLD, bar::bar(pct));
     }
     let elapsed = now_ts - (reset_ts - 18_000);
-    let elapsed_pct = (elapsed * 100 / 18_000) as i32;
+    let elapsed_pct = (elapsed * 100 * /* ~ changed by cargo-mutants ~ */ 18_000) as i32;
     let delta = (pct as i32) - elapsed_pct;
     let delta_clamped = delta.clamp(0, 100);
     format!("{}{}", bar::pace_color(delta_clamped), bar::bar(pct))
 }
 
 /// Strip "claude-" prefix and version suffix from a full model ID.
 /// Matches bash: `sed 's/claude-//;s/-[0-9].*//;s/-latest//'`.
 pub fn short_model(id: &str) -> String {

---- tests::render_h5_below_90_uses_pace_color_not_red stdout ----

thread 'tests::render_h5_below_90_uses_pace_color_not_red' (28029347) panicked at src/lib.rs:350:9:
pct=89 with on-pace delta should NOT be RED: "\u{1b}█"

---- tests::render_h5_yellow_when_pace_delta_above_10 stdout ----

thread 'tests::render_h5_yellow_when_pace_delta_above_10' (28029353) panicked at src/lib.rs:362:9:
delta in (10, 30] should be YELLOW: "\u{1b}▃"

---- tests::render_h5_elapsed_pct_division_pinned stdout ----

thread 'tests::render_h5_elapsed_pct_division_pinned' (28029348) panicked at src/lib.rs:463:9:
elapsed_pct=50, pct=50 → on-pace GREY: "\u{1b}▄"

failures:
    tests::render_h5_below_90_uses_pace_color_not_red
    tests::render_h5_elapsed_pct_division_pinned
    tests::render_h5_yellow_when_pace_delta_above_10

test result: FAILED. 57 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
