*** src/lib.rs:154:40: replace + with - in short_model

*** mutation diff:
--- src/lib.rs
+++ replace + with - in short_model
@@ -146,17 +146,17 @@
 
 /// Strip "claude-" prefix and version suffix from a full model ID.
 /// Matches bash: `sed 's/claude-//;s/-[0-9].*//;s/-latest//'`.
 pub fn short_model(id: &str) -> String {
     let s = id.strip_prefix("claude-").unwrap_or(id);
     // Truncate at the first "-<digit>" we find — that begins the version tail.
     let bytes = s.as_bytes();
     for i in 0..bytes.len().saturating_sub(1) {
-        if bytes[i] == b'-' && bytes[i + 1].is_ascii_digit() {
+        if bytes[i] == b'-' && bytes[i - /* ~ changed by cargo-mutants ~ */ 1].is_ascii_digit() {
             return s[..i].trim_end_matches("-latest").to_string();
         }
     }
     s.trim_end_matches("-latest").to_string()
 }
 
 #[cfg(test)]
 mod tests {

---- tests::short_model_strips_claude_prefix_and_version stdout ----

thread 'tests::short_model_strips_claude_prefix_and_version' (28036822) panicked at src/lib.rs:168:9:
assertion `left == right` failed
  left: "opus-4"
 right: "opus"

failures:
    tests::short_model_strips_claude_prefix_and_version

test result: FAILED. 59 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
