*** src/lib.rs:59:5: replace render_d7 -> String with "xyzzy".into()

*** mutation diff:
--- src/lib.rs
+++ replace render_d7 -> String with "xyzzy".into()
@@ -51,79 +51,17 @@
         bar::RESET,
         d7_out,
         bar::RESET
     )
 }
 
 /// Render the D7 sparkline and update history with the current observation.
 fn render_d7(window: &Window, history: &mut History, now_ts: i64) -> String {
-    let reset_ts = match window.resets_at {
-        Some(dt) => dt.timestamp(),
-        None => return format!("{}{}", bar::PAST, bar::bar(window.utilization as u8)),
-    };
-
-    // Stale: reset is in the past (window has rolled over but cache wasn't refreshed).
-    if now_ts > reset_ts {
-        let pct = window.utilization as u8;
-        if pct == 0 {
-            return format!("{}·······", bar::GREY);
-        }
-        return format!("{}███████", bar::RED_BOLD);
-    }
-
-    let cycle_start = cycle::cycle_start_for_reset(reset_ts, history);
-    let cycle_len = (reset_ts - cycle_start).max(1);
-    let idx = cycle::bucket_idx(now_ts, cycle_start, cycle_len);
-    let pct = window.utilization as u8;
-
-    let buckets_for_render: [Option<u8>; 7];
-    match cycle::match_cycle(reset_ts, history) {
-        Some(m) => {
-            cycle::apply_max_guard(&mut history.cycles[m].buckets, idx, pct);
-            buckets_for_render = history.cycles[m].buckets;
-        }
-        None => {
-            cycle::append_new_cycle(history, reset_ts, idx, pct);
-            buckets_for_render = history.cycles.last().unwrap().buckets;
-        }
-    }
-
-    let mut display = buckets_for_render;
-    cycle::forward_fill(&mut display, idx);
-
-    let elapsed_pct = ((now_ts - cycle_start) * 100 / cycle_len) as i32;
-    let delta = (pct as i32) - elapsed_pct;
-    let current_color = if pct >= 90 || delta > 30 {
-        bar::RED_BOLD
-    } else if delta > 10 {
-        bar::YELLOW_BOLD
-    } else {
-        "\x1b"
-    };
-
-    let mut out = String::new();
-    for (i, cell) in display.iter().enumerate() {
-        match cell {
-            None => {
-                let expected = ((i + 1) * 100 / 7) as u8;
-                out.push_str(bar::DIM);
-                out.push(bar::bar(expected));
-            }
-            Some(v) if i == idx => {
-                out.push_str(current_color);
-                out.push(bar::bar(*v));
-            }
-            Some(v) => {
-                out.push_str(bar::PAST);
-                out.push(bar::bar(*v));
-            }
-        }
-    }
-    out
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Render the H5 five-hour bar with pace coloring.
 fn render_h5(window: &Window, now_ts: i64) -> String {
     let pct = window.utilization as u8;
     let reset_ts = match window.resets_at {
         Some(dt) => dt.timestamp(),
         None => return format!("{}{}", bar::PAST, bar::bar(pct)),

---- tests::render_d7_baseline_uses_expected_per_cell_progression stdout ----

thread 'tests::render_d7_baseline_uses_expected_per_cell_progression' (27988013) panicked at src/lib.rs:335:9:
expected baseline chars "▃▄▅▆▇█" (positions 1..=6) in: "xyzzy"

---- tests::render_d7_current_color_red_when_pct_at_or_above_90 stdout ----

thread 'tests::render_d7_current_color_red_when_pct_at_or_above_90' (27988016) panicked at src/lib.rs:198:9:
pct=90 should produce RED current_color: "xyzzy"

---- tests::render_d7_current_color_red_when_delta_above_30 stdout ----

thread 'tests::render_d7_current_color_red_when_delta_above_30' (27988015) panicked at src/lib.rs:213:9:
delta>30 should be RED: "xyzzy"

failures:
    tests::render_d7_at_delta_exactly_30_is_yellow_not_red
    tests::render_d7_baseline_uses_expected_per_cell_progression
    tests::render_d7_current_color_red_when_delta_above_30
    tests::render_d7_current_color_red_when_pct_at_or_above_90
    tests::render_d7_current_color_yellow_when_delta_in_11_to_30
    tests::render_d7_only_current_bucket_uses_current_color
    tests::render_d7_stale_idle_renders_dim_dots
    tests::render_d7_stale_with_pct_renders_red_full

test result: FAILED. 52 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
