*** src/lib.rs:74:31: replace - with + in render_d7

*** mutation diff:
--- src/lib.rs
+++ replace - with + in render_d7
@@ -66,17 +66,17 @@
         let pct = window.utilization as u8;
         if pct == 0 {
             return format!("{}·······", bar::GREY);
         }
         return format!("{}███████", bar::RED_BOLD);
     }
 
     let cycle_start = cycle::cycle_start_for_reset(reset_ts, history);
-    let cycle_len = (reset_ts - cycle_start).max(1);
+    let cycle_len = (reset_ts + /* ~ changed by cargo-mutants ~ */ cycle_start).max(1);
     let idx = cycle::bucket_idx(now_ts, cycle_start, cycle_len);
     let pct = window.utilization as u8;
 
     let buckets_for_render: [Option<u8>; 7];
     match cycle::match_cycle(reset_ts, history) {
         Some(m) => {
             cycle::apply_max_guard(&mut history.cycles[m].buckets, idx, pct);
             buckets_for_render = history.cycles[m].buckets;

---- tests::render_d7_at_delta_exactly_10_is_default_not_yellow stdout ----

thread 'tests::render_d7_at_delta_exactly_10_is_default_not_yellow' (27992300) panicked at src/lib.rs:450:9:
delta==10 → not RED: "\u{1b}▅\u{1b}▃\u{1b}▄\u{1b}▅\u{1b}▆\u{1b}▇\u{1b}█"

---- tests::render_d7_at_delta_exactly_30_is_yellow_not_red stdout ----

thread 'tests::render_d7_at_delta_exactly_30_is_yellow_not_red' (27992301) panicked at src/lib.rs:431:9:
delta==30 → YELLOW: "\u{1b}▇\u{1b}▃\u{1b}▄\u{1b}▅\u{1b}▆\u{1b}▇\u{1b}█"

---- tests::render_d7_current_color_default_when_on_pace stdout ----

thread 'tests::render_d7_current_color_default_when_on_pace' (27992306) panicked at src/lib.rs:304:9:
on-pace should not be RED: "\u{1b}▄\u{1b}▃\u{1b}▄\u{1b}▅\u{1b}▆\u{1b}▇\u{1b}█"

failures:
    tests::render_d7_at_delta_exactly_10_is_default_not_yellow
    tests::render_d7_at_delta_exactly_30_is_yellow_not_red
    tests::render_d7_current_color_default_when_on_pace
    tests::render_d7_current_color_yellow_when_delta_in_11_to_30

test result: FAILED. 56 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
